{
  "_name_or_path": "bert-base-uncased",
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "AGRI",
    "1": "BME",
    "2": "CE",
    "3": "CHE",
    "4": "CPE",
    "5": "EDU",
    "6": "EE",
    "7": "ENV",
    "8": "IE",
    "9": "MATENG",
    "10": "MATH",
    "11": "MATSCI",
    "12": "ME",
    "13": "METAL",
    "14": "NANO",
    "15": "OPTIC",
    "16": "PE",
    "17": "SAFETY"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "AGRI": 0,
    "BME": 1,
    "CE": 2,
    "CHE": 3,
    "CPE": 4,
    "EDU": 5,
    "EE": 6,
    "ENV": 7,
    "IE": 8,
    "MATENG": 9,
    "MATH": 10,
    "MATSCI": 11,
    "ME": 12,
    "METAL": 13,
    "NANO": 14,
    "OPTIC": 15,
    "PE": 16,
    "SAFETY": 17
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "multi_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.34.0",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
